app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "rating", "genre", "year_released", "plot", "director", "actors", "poster", "rotten_tomatoes_score", "created_at", "updated_at", "imdbid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"