app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "movie_id", "review_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["movie_id", 16], ["review_text", "This is a review for Cars"], ["created_at", "2017-09-11 15:35:39.141875"], ["updated_at", "2017-09-11 15:35:39.141875"]]
---
  def create
    @review = Review.new(review_params)

    if @review.save

UPDATE "reviews" SET "review_text" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["review_text", "I have edited this review"], ["updated_at", "2017-09-11 18:03:31.702501"], ["id", 15]]
---
  def update
    if @review.update(review_params)